{
   "Images":[
    {
        "src": "https://img.indianautosblog.com/2021/06/24/front-side-fascia-of-toyota-supra-a8f2.jpeg",
        "caption": "Toyota supra",
        "desc":"The sedan is a closed-body car (fixed metal roof) with engines, passengers, and cargo in separate compartments. It’s a passenger car in a three-compartment configuration, each separate for the engine, passenger, and baggage."
      },
      {
        "src": "https://wallpaperaccess.com/full/1771425.jpg",
        "caption": "Dodge charger",
        "desc": "The body look is quite similar to that of a hatchback car. Still, the station wagons are larger and likely to extend to the roof line at the rear of the vehicle’s body (resulting in the car having a vertical rear surface) to give enough space for baggage and small cargo."
      },
      {
        "src": "https://images8.alphacoders.com/118/1183443.jpg",
        "caption": "Ford GT racing",
        "desc": "A coupe is a passenger car with a slanted or trimmed rear roof and is typically two-door (although many four-door cars have also been sold as coupes). The coupe was first fitted in horse-drawn trains for two passengers without rear seats."
      },
      {
        "src": "https://wallpaper.dog/large/17090414.jpg",
        "caption": "Caroll shelby ford mustang",
        "desc": "The hatchback is a car hatch type with rear doors that often open upward and usually have a given volume for passenger and baggage areas. When the car’s body style is described as a hatchback, it usually refers to a small utilitarian car (especially in the United States)."
      },
      {
        "src": "https://www.topgear.com/sites/default/files/news-listicle/image/dg018_130clgtqm46n89ljrl6nug4ebog7a2r.jpg",
        "caption": "Mustang v8",
        "desc": "A convertible provides for an open-air driving adventure, with the facility to provide a roof when needed. The potential drawbacks of convertibles are structural stiffness and reduced baggage area."
      }
   ]
}